import java.io.IOException;

public class G1_CarGame {
    public static void main(String[] args) {
        System.out.println("                                   _\n" +
                "                                  /!\\\n" +
                "                                 / !■\\\n" +
                "                                /  !  \\\n" +
                "                               /   !   \\\n" +
                "                              /    !    \\\n" +
                "                             /     !     \\\n" +
                "                            /      ! ■■   \\\n" +
                "                           /       !       \\\n" +
                "                          /        !        \\\n" +
                "                         /         !         \\\n" +
                "                        /          !          \\\n" +
                "                       /■■■■■■     !           \\\n" +
                "                      /            !            \\\n" +
                "                     /             !             \\\n" +
                "                    /              !              \\\n" +
                "                   /               !               \\\n" +
                "                  /                !                \\\n" +
                "                 /                 !                 \\\n" +
                "                /                  !■■■■■■■■■■■■      \\ \n" +
                "               /                   !                   \\ \n" +
                "              /                    !                    \\ \n" +
                "             /                     !                     \\ \n" +
                "            / ■■■■■■■■■■■■■        !                      \\ \n" +
                "           /                       !                       \\ \n" +
                "          /                        !                        \\ \n" +
                "         /                         !                         \\ \n" +
                "        /                          !                          \\ \n" +
                "       /                           !                           \\ \n" +
                "      /                            !■■■■■■■■■■■■■■■■■           \\ ");

        while(true){


            System.out.println("                                   _\n" +
                    "                                  /!\\\n" +
                    "                                 / !■\\\n" +
                    "                                /  !  \\\n" +
                    "                               /   !   \\\n" +
                    "                              /    !    \\\n" +
                    "                             /     !     \\\n" +
                    "                            /      ! ■■   \\\n" +
                    "                           /       !       \\\n" +
                    "                          /        !        \\\n" +
                    "                         /         !         \\\n" +
                    "                        /          !          \\\n" +
                    "                       /■■■■■■     !           \\\n" +
                    "                      /            !            \\\n" +
                    "                     /             !             \\\n" +
                    "                    /              !              \\\n" +
                    "                   /               !               \\\n" +
                    "                  /                !                \\\n" +
                    "                 /                 !                 \\\n" +
                    "                /                  !■■■■■■■■■■■■      \\ \n" +
                    "               /                   !                   \\ \n" +
                    "              /                    !                    \\ \n" +
                    "             /                     !                     \\ \n" +
                    "            /                      !                      \\ \n" +
                    "           /  ■■■■■■■■■■■■■■       !                       \\ \n" +
                    "          /                        !                        \\ \n" +
                    "         /                         !                         \\ \n" +
                    "        /                          !                          \\ \n" +
                    "       /                           !                           \\ \n" +
                    "      /                            !■■■■■■■■■■■■■■■■■           \\ ");
            try {
                Thread.currentThread().sleep(500);;
            } catch (Exception e) {
                e.printStackTrace();
            }
            System.out.print("\033c");
//            cls();

            System.out.println("                                   _\n" +
                    "                                  /!\\\n" +
                    "                                 / !■\\\n" +
                    "                                /  !  \\\n" +
                    "                               /   !   \\\n" +
                    "                              /    !    \\\n" +
                    "                             /     !     \\\n" +
                    "                            /      ! ■■   \\\n" +
                    "                           /       !       \\\n" +
                    "                          /        !        \\\n" +
                    "                         /         !         \\\n" +
                    "                        /          !          \\\n" +
                    "                       /■■■■■■     !           \\\n" +
                    "                      /            !            \\\n" +
                    "                     /             !             \\\n" +
                    "                    /              !              \\\n" +
                    "                   /               !               \\\n" +
                    "                  /                !                \\\n" +
                    "                 /                 !                 \\\n" +
                    "                /                  !■■■■■■■■■■■■      \\ \n" +
                    "               /                   !                   \\ \n" +
                    "              /                    !                    \\ \n" +
                    "             /                     !                     \\ \n" +
                    "            /                      !                      \\ \n" +
                    "           /                       !                       \\ \n" +
                    "          /  ■■■■■■■■■■■■■■■       !                        \\ \n" +
                    "         /                         !                         \\ \n" +
                    "        /                          !                          \\ \n" +
                    "       /                           !                           \\ \n" +
                    "      /                            !■■■■■■■■■■■■■■■■■           \\ ");



            try {
                Thread.currentThread().sleep(500);;
            } catch (Exception e) {
                e.printStackTrace();
            }
            System.out.print("\033c");


            System.out.println("                                   _\n" +
                    "                                  /!\\\n" +
                    "                                 / !■\\\n" +
                    "                                /  !  \\\n" +
                    "                               /   !   \\\n" +
                    "                              /    !    \\\n" +
                    "                             /     !     \\\n" +
                    "                            /      ! ■■   \\\n" +
                    "                           /       !       \\\n" +
                    "                          /        !        \\\n" +
                    "                         /         !         \\\n" +
                    "                        /          !          \\\n" +
                    "                       /■■■■■■     !           \\\n" +
                    "                      /            !            \\\n" +
                    "                     /             !             \\\n" +
                    "                    /              !              \\\n" +
                    "                   /               !               \\\n" +
                    "                  /                !                \\\n" +
                    "                 /                 !                 \\\n" +
                    "                /                  !■■■■■■■■■■■■      \\ \n" +
                    "               /                   !                   \\ \n" +
                    "              /                    !                    \\ \n" +
                    "             /                     !                     \\ \n" +
                    "            /                      !                      \\ \n" +
                    "           /                       !                       \\ \n" +
                    "          /                        !                        \\ \n" +
                    "         /   ■■■■■■■■■■■■■■■■      !                         \\ \n" +
                    "        /                          !                          \\ \n" +
                    "       /                           !                           \\ \n" +
                    "      /                            !■■■■■■■■■■■■■■■■■           \\ ");


            try {
                Thread.currentThread().sleep(500);;
            } catch (Exception e) {
                e.printStackTrace();
            }
            System.out.print("\033c");


            System.out.println("                                   _\n" +
                    "                                  /!\\\n" +
                    "                                 / !■\\\n" +
                    "                                /  !  \\\n" +
                    "                               /   !   \\\n" +
                    "                              /    !    \\\n" +
                    "                             /     !     \\\n" +
                    "                            /      ! ■■   \\\n" +
                    "                           /       !       \\\n" +
                    "                          /        !        \\\n" +
                    "                         /         !         \\\n" +
                    "                        /          !          \\\n" +
                    "                       /■■■■■■     !           \\\n" +
                    "                      /            !            \\\n" +
                    "                     /             !             \\\n" +
                    "                    /              !              \\\n" +
                    "                   /               !               \\\n" +
                    "                  /                !                \\\n" +
                    "                 /                 !                 \\\n" +
                    "                /                  !■■■■■■■■■■■■      \\ \n" +
                    "               /                   !                   \\ \n" +
                    "              /                    !                    \\ \n" +
                    "             /                     !                     \\ \n" +
                    "            /                      !                      \\ \n" +
                    "           /                       !                       \\ \n" +
                    "          /                        !                        \\ \n" +
                    "         /                         !                         \\ \n" +
                    "        /    ■■■■■■■■■■■■■■■■■     !                          \\ \n" +
                    "       /                           !                           \\ \n" +
                    "      /                            !■■■■■■■■■■■■■■■■■           \\ ");


            try {
                Thread.currentThread().sleep(500);;
            } catch (Exception e) {
                e.printStackTrace();
            }
            System.out.print("\033c");

            System.out.println("                                   _\n" +
                    "                                  /!\\\n" +
                    "                                 / !■\\\n" +
                    "                                /  !  \\\n" +
                    "                               /   !   \\\n" +
                    "                              /    !    \\\n" +
                    "                             /     !     \\\n" +
                    "                            /      ! ■■   \\\n" +
                    "                           /       !       \\\n" +
                    "                          /        !        \\\n" +
                    "                         /         !         \\\n" +
                    "                        /          !          \\\n" +
                    "                       /■■■■■■     !           \\\n" +
                    "                      /            !            \\\n" +
                    "                     /             !             \\\n" +
                    "                    /              !              \\\n" +
                    "                   /               !               \\\n" +
                    "                  /                !                \\\n" +
                    "                 /                 !                 \\\n" +
                    "                /                  !■■■■■■■■■■■■      \\ \n" +
                    "               /                   !                   \\ \n" +
                    "              /                    !                    \\ \n" +
                    "             /                     !                     \\ \n" +
                    "            /                      !                      \\ \n" +
                    "           /                       !                       \\ \n" +
                    "          /                        !                        \\ \n" +
                    "         /                         !                         \\ \n" +
                    "        /                          !                          \\ \n" +
                    "       /     ■■■■■■■■■■■■■■■■■■    !                           \\ \n" +
                    "      /                            !■■■■■■■■■■■■■■■■■           \\ ");

            try {
                Thread.currentThread().sleep(500);;
            } catch (Exception e) {
                e.printStackTrace();
            }
            System.out.print("\033c");

            System.out.println("                                   _\n" +
                    "                                  /!\\\n" +
                    "                                 / !■\\\n" +
                    "                                /  !  \\\n" +
                    "                               /   !   \\\n" +
                    "                              /    !    \\\n" +
                    "                             /     !     \\\n" +
                    "                            /      ! ■■   \\\n" +
                    "                           /       !       \\\n" +
                    "                          /        !        \\\n" +
                    "                         /         !         \\\n" +
                    "                        /          !          \\\n" +
                    "                       /■■■■■■     !           \\\n" +
                    "                      /            !            \\\n" +
                    "                     /             !             \\\n" +
                    "                    /              !              \\\n" +
                    "                   /               !               \\\n" +
                    "                  /                !                \\\n" +
                    "                 /                 !                 \\\n" +
                    "                /                  !■■■■■■■■■■■■      \\ \n" +
                    "               /                   !                   \\ \n" +
                    "              /                    !                    \\ \n" +
                    "             /                     !                     \\ \n" +
                    "            /                      !                      \\ \n" +
                    "           /                       !                       \\ \n" +
                    "          /                        !                        \\ \n" +
                    "         /                         !                         \\ \n" +
                    "        /                          !                          \\ \n" +
                    "       /                           !                           \\ \n" +
                    "      /      ■■■■■■■■■■■■■■■■■■■   !■■■■■■■■■■■■■■■■■           \\ ");

            try {
                Thread.currentThread().sleep(500);;
            } catch (Exception e) {
                e.printStackTrace();
            }
            System.out.print("\033c");
//            cls();
        }
    }


    public static void cls()
    {
        try {
            //// 新建一个 ProcessBuilder，其要执行的命令是 cmd.exe，参数是 /c 和 cls
            new ProcessBuilder("cmd", "/c", "cls")
                    // 将 ProcessBuilder 对象的输出管道和 Java 的进程进行关联，这个函数的返回值也是一个
                    // ProcessBuilder
                    .inheritIO()
                    // 开始执行 ProcessBuilder 中的命令
                    .start()
                    // 等待 ProcessBuilder 中的清屏命令执行完毕
                    // 如果不等待则会出现清屏代码后面的输出被清掉的情况
                    .waitFor(); // 清屏命令

        }catch (Exception e){

        }

    }

}
